{"name":"FunkLocker Ransomware File Creation","tags":["attack.t1486","detection.emerging-threats"],"interval":"5m","enabled":true,"revision":0,"description":"Detects the creation of files with the \".funksec\" extension, which is appended to encrypted files by the FunkLocker ransomware.","risk_score":21,"severity":"high","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Saiprashanth Pulisetti ( @Prashanthblogs)"],"false_positives":["Unlikely"],"from":"now-360s","rule_id":"2c76a22b-702d-48fd-8fa9-e41e2fe203b3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://www.broadcom.com/support/security-center/protection-bulletin/funksec-ransomware","https://www.pcrisk.com/removal-guides/31853-funklocker-funksec-ransomware"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE file.path.text rlike \".*.[Ff][Uu][Nn][Kk][Ss][Ee][Cc].*\"","actions":[]}