{"description":"Detects usage of HollowReaper, a process hollowing shellcode launcher used for stealth payload execution through process hollowing.\nIt replaces the memory of a legitimate process with custom shellcode, allowing the attacker to execute payloads under the guise of trusted binaries.\n. License: DRL 1.1.","author":["Swachchhanda Shrawan Poudel (Nextron Systems)"],"enabled":true,"false_positives":[],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"85d23b42-9a9d-4f8f-b3d7-d2733c1d58f5","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"HackTool - HollowReaper Execution","query":"index=\"winlogbeat-*\" AND (event.code:4688 OR winlog.event_id:4688) AND winlog.event_data.NewProcessName:*\\\\HollowReaper\\.exe","meta":{"from":"1m"},"severity":"high","tags":["attack.defense-evasion","attack.t1055.012"],"to":"now","type":"query","threat":[],"version":1,"references":["https://github.com/vari-sh/RedTeamGrimoire/tree/b5e7635d34db6e1f0398d8847e8f293186e947c5/HollowReaper"],"license":"DRL 1.1"}