{"name":"IOCs (ip) to detect: UNC3944 Targets SaaS Applications","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"UNC3944 is a financially motivated threat group that has evolved its tactics to focus on data theft from SaaS applications, utilizing social engineering, credential harvesting, and exploiting cloud services for persistence and lateral movement. The group has shifted from ransomware to primarily data theft extortion, employing fearmongering tactics to gain access to victim credentials. Their operations have been observed targeting various industries and leveraging tools for reconnaissance and data exfiltration.","risk_score":21,"severity":"medium","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Uncoder Autogenerated"],"false_positives":[],"from":"now-360s","rule_id":"687f147f-9860-4072-8105-0a6f1bb8b239","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE destination.address == \"96.242.13.152\"","actions":[]}