{"name":"IOCs (ip) to detect: Curly COMrades: A New Threat Actor Targeting Geopolitical Hotbeds","tags":["T1016","T1041","T1048","T1071","T1105","T1567"],"interval":"5m","enabled":true,"revision":0,"description":"The report details the activities of a new threat actor group named Curly COMrades, which has been targeting critical organizations in Georgia and Moldova to support Russian interests. Their primary goal is to maintain long-term access to networks and steal credentials, utilizing sophisticated techniques such as proxy tools, a new backdoor called MucorAgent, and hijacking legitimate processes for persistence. The report emphasizes the need for organizations to enhance their security measures against such advanced threats.","risk_score":21,"severity":"medium","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Uncoder Autogenerated"],"false_positives":[],"from":"now-360s","rule_id":"f31235f4-72ac-4d34-8a3f-4b21debeea17","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://businessinsights.bitdefender.com/curly-comrades-new-threat-actor-targeting-geopolitical-hotbeds"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE (destination.address == \"96.30.124.103\" or destination.address == \"91.107.174.190\" or destination.address == \"194.87.31.171\" or destination.address == \"75.127.13.136\" or destination.address == \"94.131.109.91\" or destination.address == \"207.180.194.109\" or destination.address == \"124.0.0.0\" or destination.address == \"45.43.91.10\")","actions":[]}