{"name":"Possible DLL Hijacking of tsmsisrv.dll","tags":["attack.T1574.001","attack.defense_evasion"],"interval":"5m","enabled":true,"revision":0,"description":"Detects possible DLL hijacking of tsmsisrv.dll by looking for suspicious image loads, loading this DLL from unexpected locations.","risk_score":21,"severity":"low","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Swachchhanda Shrawan Poudel"],"false_positives":["False positives are likely. This rule is more suitable for hunting than for generating detections."],"from":"now-360s","rule_id":"1524791b-3647-48a3-1087-5b9ff8891530","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005"},"framework":"MITRE ATT&CK","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"to":"now","references":["https://hijacklibs.net/entries/microsoft/built-in/tsmsisrv.html"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE (dll.path == \"*\\\\\\\\tsmsisrv.dll\" or file.path == \"*\\\\\\\\tsmsisrv.dll\")","actions":[]}