{"name":"Potential PowerShell Console History Access Attempt via History File","tags":["attack.credential-access","attack.t1552.001"],"interval":"5m","enabled":true,"revision":0,"description":"Detects potential access attempts to the PowerShell console history directly via history file (ConsoleHost_history.txt).\nThis can give access to plaintext passwords used in PowerShell commands or used for general reconnaissance.\n","risk_score":21,"severity":"medium","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Luc Génaux"],"false_positives":["Legitimate access of the console history file is possible"],"from":"now-360s","rule_id":"f4ff7323-b5fc-4323-8b52-6b9408e15788","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://0xdf.gitlab.io/2018/11/08/powershell-history-file.html"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE (process.command_line.text rlike \".*[Cc][Oo][Nn][Ss][Oo][Ll][Ee][Hh][Oo][Ss][Tt]_[Hh][Ii][Ss][Tt][Oo][Rr][Yy].[Tt][Xx][Tt].*\" or process.command_line.text rlike \".*([Gg][Ee][Tt]-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn]).[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Pp][Aa][Tt][Hh].*\")","actions":[]}