{"name":"Registry Manipulation via WMI Stdregprov","tags":["attack.defense-evasion","attack.discovery","attack.execution","attack.t1012","attack.t1047","attack.t1112"],"interval":"5m","enabled":true,"revision":0,"description":"Detects the usage of wmic.exe to manipulate Windows registry via the WMI StdRegProv class.\nThis behaviour could be potentially suspicious because it uses an alternative method to modify registry keys instead of legitimate registry tools like reg.exe or regedit.exe.\nAttackers specifically choose this technique to evade detection and bypass security monitoring focused on traditional registry modification commands.\n","risk_score":21,"severity":"medium","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Daniel Koifman (KoifSec)"],"false_positives":["Legitimate administrative activity"],"from":"now-360s","rule_id":"c453ab7a-1f5c-4716-a3b4-dea8135fb43a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002"},"framework":"MITRE ATT&CK","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"}]},{"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007"},"framework":"MITRE ATT&CK","technique":[{"id":"T1012","name":"Query Registry","reference":"https://attack.mitre.org/techniques/T1012"}]}],"to":"now","references":["https://www.bitdefender.com/en-us/blog/businessinsights/shrinklocker-decryptor-from-friend-to-foe-and-back-again","https://trustedsec.com/blog/command-line-underdog-wmic-in-action","https://trustedsec.com/blog/wmi-for-script-kiddies"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE ((process.executable.text rlike \".*\\\\\\\\[Ww][Mm][Ii][Cc].[Ee][Xx][Ee].*\" or winlog.event_data.OriginalFileName == \"wmic.exe\") and (process.command_line.text rlike \".*[Cc][Aa][Ll][Ll].*\" and process.command_line.text rlike \".*[Ss][Tt][Dd][Rr][Ee][Gg][Pp][Rr][Oo][Vv].*\"))","actions":[]}