{"name":"Suspicious Child Process of SAP NetWeaver - Linux","tags":["attack.initial-access","attack.persistence","attack.t1059.003","attack.t1190","cve.2025-31324","detection.emerging-threats"],"interval":"5m","enabled":true,"revision":0,"description":"Detects suspicious child processes spawned by SAP NetWeaver on Linux systems that could indicate potential\nexploitation of vulnerability that allows arbitrary execution via webshells such as CVE-2025-31324.\n","risk_score":21,"severity":"medium","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Elastic (idea)","Swachchhanda Shrawan Poudel (Nextron Systems)"],"false_positives":["Legitimate administrative activities such as software updates"],"from":"now-360s","rule_id":"69dea60b-2deb-4c9e-a685-ad542f4367f9","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://reliaquest.com/blog/threat-spotlight-reliaquest-uncovers-vulnerability-behind-sap-netweaver-compromise/","https://onapsis.com/blog/active-exploitation-of-sap-vulnerability-cve-2025-31324/"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE ((process.parent.executable.text rlike \".*/[Jj]2[Ee][Ee]/[Cc][Ll][Uu][Ss][Tt][Ee][Rr]/[Aa][Pp][Pp][Ss]/[Ss][Aa][Pp].[Cc][Oo][Mm]/[Ii][Rr][Jj]/[Ss][Ee][Rr][Vv][Ll][Ee][Tt]_[Jj][Ss][Pp]/[Ii][Rr][Jj]/[Ww][Oo][Rr][Kk].*\" or process.parent.executable.text rlike \".*/[Jj]2[Ee][Ee]/[Cc][Ll][Uu][Ss][Tt][Ee][Rr]/[Aa][Pp][Pp][Ss]/[Ss][Aa][Pp].[Cc][Oo][Mm]/[Ii][Rr][Jj]/[Ss][Ee][Rr][Vv][Ll][Ee][Tt]_[Jj][Ss][Pp]/[Ii][Rr][Jj]/[Rr][Oo][Oo][Tt].*\") or (process.working_directory.text rlike \".*/[Jj]2[Ee][Ee]/[Cc][Ll][Uu][Ss][Tt][Ee][Rr]/[Aa][Pp][Pp][Ss]/[Ss][Aa][Pp].[Cc][Oo][Mm]/[Ii][Rr][Jj]/[Ss][Ee][Rr][Vv][Ll][Ee][Tt]_[Jj][Ss][Pp]/[Ii][Rr][Jj]/[Ww][Oo][Rr][Kk].*\" or process.working_directory.text rlike \".*/[Jj]2[Ee][Ee]/[Cc][Ll][Uu][Ss][Tt][Ee][Rr]/[Aa][Pp][Pp][Ss]/[Ss][Aa][Pp].[Cc][Oo][Mm]/[Ii][Rr][Jj]/[Ss][Ee][Rr][Vv][Ll][Ee][Tt]_[Jj][Ss][Pp]/[Ii][Rr][Jj]/[Rr][Oo][Oo][Tt].*\")) and (process.executable.text rlike \".*/[Aa][Ss][Hh].*\" or process.executable.text rlike \".*/[Bb][Aa][Ss][Hh].*\" or process.executable.text rlike \".*/[Cc][Ss][Hh].*\" or process.executable.text rlike \".*/[Dd][Aa][Ss][Hh].*\" or process.executable.text rlike \".*/[Kk][Ss][Hh].*\" or process.executable.text rlike \".*/[Ss][Hh].*\" or process.executable.text rlike \".*/[Tt][Cc][Ss][Hh].*\" or process.executable.text rlike \".*/[Zz][Ss][Hh].*\" or process.executable.text rlike \".*/[Pp][Yy][Tt][Hh][Oo][Nn].*\" or process.executable.text rlike \".*/[Pp][Yy][Tt][Hh][Oo][Nn]2.*\" or process.executable.text rlike \".*/[Pp][Yy][Tt][Hh][Oo][Nn]3.*\" or process.executable.text rlike \".*/[Pp][Ee][Rr][Ll].*\" or process.executable.text rlike \".*/[Rr][Uu][Bb][Yy].*\" or process.executable.text rlike \".*/[Cc][Uu][Rr][Ll].*\" or process.executable.text rlike \".*/[Ww][Gg][Ee][Tt].*\" or process.executable.text rlike \".*/[Nn][Cc].*\" or process.executable.text rlike \".*/[Nn][Ee][Tt][Cc][Aa][Tt].*\" or process.executable.text rlike \".*/[Nn][Cc][Aa][Tt].*\" or process.executable.text rlike \".*/[Ss][Oo][Cc][Aa][Tt].*\" or process.executable.text rlike \".*/[Nn][Mm][Aa][Pp].*\" or process.executable.text rlike \".*/[Tt][Ee][Ll][Nn][Ee][Tt].*\" or process.executable.text rlike \".*/[Aa][Ww][Kk].*\" or process.executable.text rlike \".*/[Ss][Ee][Dd].*\")","actions":[]}