{"name":"Suspicious Velociraptor Child Process","tags":["attack.defense-evasion","attack.persistence","attack.t1219"],"interval":"5m","enabled":true,"revision":0,"description":"Detects the suspicious use of the Velociraptor DFIR tool to execute other tools or download additional payloads, as seen in a campaign where it was abused for remote access and to stage further attacks.","risk_score":21,"severity":"high","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Swachchhanda Shrawan Poudel (Nextron Systems)"],"false_positives":["Legitimate administrators or incident responders might use Velociraptor to execute scripts or tools. However, the combination of Velociraptor spawning these specific processes with these command lines is suspicious. Tuning may be required to exclude known administrative actions or specific scripts."],"from":"now-360s","rule_id":"4bc90587-e6ca-4b41-be0b-ed4d04e4ed0c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://news.sophos.com/en-us/2025/08/26/velociraptor-incident-response-tool-abused-for-remote-access/"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE process.parent.executable.text rlike \".*\\\\\\\\[Vv][Ee][Ll][Oo][Cc][Ii][Rr][Aa][Pp][Tt][Oo][Rr].[Ee][Xx][Ee].*\" and ((process.command_line.text rlike \".*[Cc][Oo][Dd][Ee].[Ee][Xx][Ee].*\" and process.command_line.text rlike \".*[Tt][Uu][Nn][Nn][Ee][Ll].*\" and process.command_line.text rlike \".*--[Aa][Cc][Cc][Ee][Pp][Tt]-[Ss][Ee][Rr][Vv][Ee][Rr]-[Ll][Ii][Cc][Ee][Nn][Ss][Ee]-[Tt][Ee][Rr][Mm][Ss].*\") or (process.command_line.text rlike \".*[Mm][Ss][Ii][Ee][Xx][Ee][Cc].*\" and process.command_line.text rlike \".*/[Ii].*\" and process.command_line.text rlike \".*[Hh][Tt][Tt][Pp].*\") or ((process.executable.text rlike \".*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].[Ee][Xx][Ee].*\" or process.executable.text rlike \".*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee].[Ee][Xx][Ee].*\" or process.executable.text rlike \".*\\\\\\\\[Pp][Ww][Ss][Hh].[Ee][Xx][Ee].*\") and (process.command_line.text rlike \".*[Ii][Nn][Vv][Oo][Kk][Ee]-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt] .*\" or process.command_line.text rlike \".*[Ii][Ww][Rr] .*\" or process.command_line.text rlike \".*.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee].*\" or process.command_line.text rlike \".*.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*\")))","actions":[]}