{"name":"System Information Discovery via Registry Queries","tags":["attack.discovery","attack.t1082"],"interval":"5m","enabled":true,"revision":0,"description":"Detects attempts to query system information directly from the Windows Registry.","risk_score":21,"severity":"low","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["lazarg"],"false_positives":["Unlikely"],"from":"now-360s","rule_id":"0022869c-49f7-4ff2-ba03-85ac42ddac58","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007"},"framework":"MITRE ATT&CK","technique":[{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082"}]}],"to":"now","references":["https://cert.gov.ua/article/6277849","https://github.com/redcanaryco/atomic-red-team/blob/75fa21076dcefa348a7521403cdd6bfc4e88623c/atomics/T1082/T1082.md","https://github.com/redcanaryco/atomic-red-team/blob/75fa21076dcefa348a7521403cdd6bfc4e88623c/atomics/T1124/T1124.md"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE ((process.executable.text rlike \".*\\\\\\\\[Rr][Ee][Gg].[Ee][Xx][Ee].*\" and process.command_line.text rlike \".*[Qq][Uu][Ee][Rr][Yy].*\" and (process.command_line.text rlike \".*-[Vv].*\" or process.command_line.text rlike \".*/[Vv].*\")) or ((process.executable.text rlike \".*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].[Ee][Xx][Ee].*\" or process.executable.text rlike \".*\\\\\\\\[Pp][Ww][Ss][Hh].[Ee][Xx][Ee].*\") and (process.command_line.text rlike \".*[Gg][Ee][Tt]-[Ii][Tt][Ee][Mm][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy][Vv][Aa][Ll][Uu][Ee].*\" or process.command_line.text rlike \".*[Gg][Pp][Vv].*\"))) and (process.command_line.text rlike \".*\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\\\\\[Tt][Ii][Mm][Ee][Zz][Oo][Nn][Ee][Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn].*\" or process.command_line.text rlike \".*\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\\\\\[Tt][Cc][Pp][Ii][Pp]\\\\\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\\\\\[Ii][Nn][Tt][Ee][Rr][Ff][Aa][Cc][Ee][Ss].*\" or process.command_line.text rlike \".*\\\\\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss] [Nn][Tt]\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*\" or process.command_line.text rlike \".*\\\\\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\\\\\[Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll].*\" or process.command_line.text rlike \".*\\\\\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss] [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr].*\" or process.command_line.text rlike \".*\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss].*\" or process.command_line.text rlike \".*\\\\\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss] [Nn][Tt]\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\\\\\[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]\\\\\\\\[Tt][Aa][Ss][Kk][Cc][Aa][Cc][Hh][Ee]\\\\\\\\[Tt][Aa][Ss][Kk][Ss].*\")","actions":[]}