{"version":1,"type":"detection-rule","rule_id":"defense-evasion-virtualization-sandbox-evasion-t1497-003","name":"Defense Evasion - Time Based Evasion (T1497.003)","description":"Detects attempts to evade sandbox by delaying execution or measuring execution time to detect virtualized environments.","risk_score":75,"severity":"medium","author":["Wahid Hendrawan"],"tags":["MITRE:T1497.003","Defense Evasion","Time Based Evasion","Sandbox Evasion"],"query":"process.args:(*Sleep* OR *SetTimer* OR *NtDelayExecution* OR *QueryPerformanceCounter* OR *GetTickCount* OR *time delta* OR *sleep 300000*)","index":["logs-windows.sysmon-*","logs-endpoint.events.*"],"language":"kuery","type":"query","from":"now-15m","interval":"5m","enabled":true,"references":["https://attack.mitre.org/techniques/T1497/003/"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1497.003","name":"Time Based Evasion","reference":"https://attack.mitre.org/techniques/T1497/003/"}]}]}