{"name":"Windows Recovery Environment Disabled Via Reagentc","tags":["attack.impact","attack.t1490"],"interval":"5m","enabled":true,"revision":0,"description":"Detects attempts to disable windows recovery environment using Reagentc.\nReAgentc.exe is a command-line tool in Windows used to manage the Windows Recovery Environment (WinRE).\nIt allows users to enable, disable, and configure WinRE, which is used for troubleshooting and repairing common boot issues.\n","risk_score":21,"severity":"medium","license":"DRL 1.1","output_index":"","meta":{"from":"1m"},"author":["Daniel Koifman (KoifSec)","Michael Vilshin"],"false_positives":["Legitimate administrative activity"],"from":"now-360s","rule_id":"db1c21e4-cd66-4b4e-85ca-590f0780529c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"tactic":{"id":"TA0040","name":"Impact","reference":"https://attack.mitre.org/tactics/TA0040"},"framework":"MITRE ATT&CK","technique":[{"id":"T1490","name":"Inhibit System Recovery","reference":"https://attack.mitre.org/techniques/T1490"}]}],"to":"now","references":["https://www.elastic.co/security-labs/maas-appeal-an-infostealer-rises-from-the-ashes","https://learn.microsoft.com/en-us/windows-hardware/manufacture/desktop/reagentc-command-line-options?view=windows-11"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"esql","language":"esql","query":"FROM logs-* metadata _id, _version, _index | WHERE ((process.executable.text rlike \".*\\\\\\\\[Rr][Ee][Aa][Gg][Ee][Nn][Tt][Cc].[Ee][Xx][Ee].*\" or winlog.event_data.OriginalFileName == \"reagentc.exe\") and (process.command_line.text rlike \".*/[Dd][Ii][Ss][Aa][Bb][Ll][Ee].*\" or process.command_line.text rlike \".*-[Dd][Ii][Ss][Aa][Bb][Ll][Ee].*\"))","actions":[]}